import '../css/background.css';
import {Fragment} from "react";
import Header from './header'
import Footer from './footer'
function Background() {
    return (
        <Fragment>
            <Header/>
            <div id='background'>
                <div id='title'>
                    <span>Welcome to Yogendra Higher Secondary School</span>
                    <span></span>
                </div>
                <div id='container'>
                    <div id='image'>
                        <img src={require('./../images/school/new_school.jpg')}/>
                    </div>
                    <div id='text'>
                        <span>ऐतिहासिक पृष्ठभूमि</span><br/>
                        हिमालपारिको जिल्ला मुस्ताङको थासाङ गाँउपालिका वडा नं १ को ऐतिहासिक टुकुचे गाँउ स्थित श्री योगेन्द्र माध्यमिक विद्यालयको स्थापना वि सं २००७ साल भाद्र २४ गते भएको थियो । जनता प्राथमिक विद्यालयवाट शुरु भएको टुकुचे निम्नमाध्यमिक हुदैं योगेन्द्र माध्यमिक विद्यालय नामाकरण हुनपुग्यो।यस विद्यालयको संस्थापक अध्यक्ष स्व ‌इन्द्रमान शेरचन र प्र अ महेन्द्र शेरचन हुनुहुन्थ्यो ।यस विद्यालय वि सं २०१३ सालमा निम्न माध्यमिक वि सं २०४३ सालमा माध्यमिक र वि सं २०६५ सालमा कक्षा ११ र १२ स्वीकृत भइ संचालनमा अएको थियो ।यस विद्यालयमा हाल प्रारम्भिक वालकक्षा  देखि कक्षा १२ सम्म संचालित छ।कक्षा ११ र १२ मा शिक्षा र व्यवस्थापन विषयको पढाइ हुदै आएको छ ।   वि सं २०७७ सालमा यस विद्यालय नेपाल सरकार शिक्षा विज्ञान तथा प्रविधि मन्त्रालयवाट नमुना विद्यालय विकासका लागि छनोट भइ नमुना विद्यालय विकास कार्यक्रम संचालन भइ रहेकोछ ।यस विद्यालयमा प्रारम्भिक वालकक्षामा प्लेग्रुप नर्सरी केजीमा अंग्रेजी माध्यमवाट पढाइ हुन्छ कक्षा १ देखि कक्षा १० सम्म गणित विज्ञान र कम्प्युटर विषय अंग्रेजी माध्यमवाट पढाइदै आइएकोछ ।
                        यस विद्यालयमा अध्ययनरत कक्षा ४ देखि कक्षा १२ सम्मका विद्यार्थीहरुलाई छुटटाछुटटै छात्रावासको सुविधा प्रदान गरिएकोछ ।गरिव जेहन्दार र दलित विद्यार्थीहरुलाई छात्रवृत्ति र उत्कृष्ठ नतिजा हासिल गर्ने विद्यार्थीलाई अक्षयकोषवाट पुरस्कारको व्यवस्था गरिन्छ ।यस विद्यालय जिल्ला कै पुरानो र उत्कृष्ठ विद्यालय हो । हाल यस विद्यालयमा मुस्ताङ जिल्लाका विभिन्न गाँउका साथै म्याग्दी वागलुङ पर्वत कास्की रोल्पा रुकुम का विद्यार्थीहरु अध्ययन गिररहेकाछन ।
                    </div>

              </div>
            </div>
            <div id='pathyakram'>
                <div id='container'>
                    <div className='item'>
                        <div id='image'>
                            <img src={require('./../images/school/new_school.jpg')}/>
                            <div id='title'>विद्यालको पुरानो भवन</div>
                        </div>
                        <div id='title'>
                            विद्यालयको भवन
                        </div>
                        <div id='about'>
                            शैक्षिक भवन संख्या तर्फ २ वटा, छात्रावास भवन तर्फ ३ वटा, सभा हल १ वटा र पुरानो भवन १ वटा रहेका छन् ।
                        </div>
                    </div>
                    <div className='item'>
                        <div id='title'>
                            पाठ्यक्रम
                        </div>
                        <div id='about'>
                            प्रारम्भिक वालकक्षा - प्लेग्रुप  नर्सरी केजी मा अंग्रेजी माध्यमवाट पढाई हुन्छ ।
                            कक्षा १ देखि कक्षा १२ सम्म गणित विज्ञान र कम्प्युटर विज्ञान विषयको अंग्रेजी माध्यमवाट अध्यापन गराईन्छ ।
                            कक्षा ११ र १२ मा व्यवस्थापन विषय लेखा अर्थशास्त्र व्यावसायिक अध्ययन कम्प्युटर विज्ञान र
                            शिक्षा विषय अन्तर्गत अग्रेजी गणित नेपाली  मुख्य विषयको अध्यापन गराइन्छ ।
                        </div>
                        <div id='title'>
                            विद्यालय समिति
                        </div>
                        <div id='about'>
                            विद्यालय व्यवस्थापन समिति दिपसागर थकालीको अध्यक्षतामा ९ सदस्य
                            शिक्षक अभिभावक संघ  निशा केसी लालचनको अध्यक्षतामा ११ सदस्य
                            छात्रावास समिति  खरिद समिति विषयगत समिति शिक्षक कार्यविभाजन वालक्लव जुनियर रेडक्रस आदि ।
                        </div>
                    </div>
                    <div className='item'>
                        <div id='title'>
                            विद्यार्थी विवरण
                        </div>
                        <div id='about'>
                            <div className='item'>
                                <img src={require('./../icons/arrow-right.svg').default}/>
                                <span>प्रारम्भिक वालकक्षा - ४९ जना</span>
                            </div>
                            <div className='item'>
                                <img src={require('./../icons/arrow-right.svg').default}/>
                                <span>कक्षा १ देखि ८ सम्म - १५६ जना</span>
                            </div>
                            <div className='item'>
                                <img src={require('./../icons/arrow-right.svg').default}/>
                                <span>कक्षा ९ देखि १२ सम्म - ५९  जना</span>
                            </div>
                            <div className='item'>
                                <img src={require('./../icons/arrow-right.svg').default}/>
                                <span>जम्मा - २६४ जना</span>
                            </div>
                        </div>
                        <div id='image'>
                            <img src={require('./../images/students/1.JPG')}/>
                            <div id='title'>विद्यार्थिहरु लाईनमा बस्दै</div>
                        </div>
                    </div>
                </div>
            </div>
            <Footer/>
        </Fragment>
    );
}
export default Background;